<?php

/*
|--------------------------------------------------------------------------
| Створіть додаток
|------------------------------------------------ ------------------------
|
| Перше, що ми зробимо, це створимо новий екземпляр програми Laravel
| який служить «клеєм» для всіх компонентів Laravel
| контейнер IoC для системи, що зв’язує всі різні частини.
|
*/

$app = new Illuminate\Foundation\Application(
    $_ENV['APP_BASE_PATH'] ?? dirname(__DIR__)
);

/*
|--------------------------------------------------------------------------
| Прив’язка важливих інтерфейсів
|------------------------------------------------ ------------------------
|
| Далі нам потрібно прив’язати деякі важливі інтерфейси до контейнера
| ми зможемо вирішити їх, коли буде потрібно. Ядра служать
| вхідні запити до цієї програми як з Інтернету, так і з CLI.
|
*/

$app->singleton(
    Illuminate\Contracts\Http\Kernel::class,
    App\Http\Kernel::class
);

$app->singleton(
    Illuminate\Contracts\Console\Kernel::class,
    App\Console\Kernel::class
);

$app->singleton(
    Illuminate\Contracts\Debug\ExceptionHandler::class,
    App\Exceptions\Handler::class
);

/*
|--------------------------------------------------------------------------
| Повернути заявку
|------------------------------------------------ ------------------------
|
| Цей сценарій повертає екземпляр програми. Примірник надано
| сценарій виклику, щоб ми могли відокремити створення екземплярів
| від фактичного запуску програми та надсилання відповідей.
|
*/

return $app;
