<?php

use Illuminate\Support\Facades\Broadcast;

/*
|--------------------------------------------------------------------------
| Трансляція каналів
|------------------------------------------------ ------------------------
|
| Тут ви можете зареєструвати всі ваші канали трансляції подій
| додаток підтримує. Дані зворотні виклики авторизації каналу є
| використовується для перевірки, чи може автентифікований користувач слухати канал.
|
*/

Broadcast::channel('App.Models.User.{id}', function ($user, $id) {
    return (int) $user->id === (int) $id;
});
