<?php

use Illuminate\Foundation\Inspiring;
use Illuminate\Support\Facades\Artisan;

/*
|--------------------------------------------------------------------------
| Консольні маршрути
|------------------------------------------------ ------------------------
|
| У цьому файлі ви можете визначити всю свою консоль на основі Closure
| команди. Кожне закриття прив’язане до екземпляра команди, що дозволяє a
| простий підхід до взаємодії з методами введення-виведення кожної команди.
|
*/

Artisan::command('inspire', function () {
    $this->comment(Inspiring::quote());
})->purpose('Display an inspiring quote');
