<?php

use Illuminate\Support\Facades\Facade;
use Illuminate\Support\ServiceProvider;

return [

    /*
    |--------------------------------------------------------------------------
    | Назва програми
    |------------------------------------------------ ------------------------
    |
    | Це значення є назвою вашої програми. Це значення використовується, коли
    | Framework має розмістити назву програми в сповіщенні або
    | будь-яке інше розташування відповідно до вимог програми або її пакетів.
    |
    */

    'name' => env('APP_NAME', 'Laravel'),

    /*
    |--------------------------------------------------------------------------
    | Середовище застосування
    |------------------------------------------------ ------------------------
    |
    | Це значення визначає «середовище», у якому зараз перебуває ваша програма
    | це може визначити, як ви віддаєте перевагу налаштуванню різних
    | послуги, які використовує програма. Встановіть це у своєму файлі ".env".
    |
    */

    'env' => env('APP_ENV', 'production'),

    /*
    |--------------------------------------------------------------------------
    | Режим налагодження програми
    |------------------------------------------------ ------------------------
    |
    | Коли ваша програма перебуває в режимі налагодження, докладні повідомлення про помилки з
    | трасування стека буде показано для кожної помилки, яка виникає у вашому
    | додаток. Якщо вимкнено, відображається проста сторінка загальної помилки.
    |
    */

    'debug' => (bool) env('APP_DEBUG', false),

    /*
    |--------------------------------------------------------------------------
    | URL програми
    |------------------------------------------------ ------------------------
    |
    | Ця URL-адреса використовується консоллю для правильного створення URL-адрес під час використання
    | інструмент командного рядка Artisan. Ви повинні встановити це в корінь
    | вашу програму, щоб вона використовувалася під час виконання завдань Artisan.
    |
    */

    'url' => env('APP_URL', 'http://localhost'),

    'asset_url' => env('ASSET_URL'),

    /*
    |--------------------------------------------------------------------------
    | Часовий пояс програми
    |------------------------------------------------ ------------------------
    |
    | Тут ви можете вказати часовий пояс за умовчанням для вашої програми, який
    | використовуватимуться функціями дати й часу PHP. Ми пішли
    | і встановіть це значення за замовчуванням.
    |
    */

    'timezone' => 'UTC',

    /*
    |--------------------------------------------------------------------------
    | Конфігурація мови програми
    |------------------------------------------------ ------------------------
    |
    | Мова програми визначає мову за замовчуванням, яка буде використана
    | постачальником послуг перекладу. Ви можете встановити це значення
    | до будь-якої локалі, яка підтримуватиметься програмою.
    |
    */

    'locale' => 'en',

    /*
    |--------------------------------------------------------------------------
    | Резервний мовний код програми
    |------------------------------------------------ ------------------------
    |
    | Запасна локаль визначає локаль для використання, коли поточна
    | недоступний. Ви можете змінити значення, щоб відповідати будь-якому з
    | мовні папки, які надаються через вашу програму.
    |
    */

    'fallback_locale' => 'en',

    /*
    |--------------------------------------------------------------------------
    | Faker Locale
    |------------------------------------------------ ------------------------
    |
    | Ця локаль буде використовуватися бібліотекою Faker PHP під час генерації підробки
    | дані для вихідних даних вашої бази даних. Наприклад, це буде використано для отримання
    | локалізовані номери телефонів, інформацію про вулицю тощо.
    |
    */

    'faker_locale' => 'en_US',

    /*
    |--------------------------------------------------------------------------
    | Ключ шифрування
    |------------------------------------------------ ------------------------
    |
    | Цей ключ використовується службою шифрування Illuminate і його слід налаштувати
    | до випадкового рядка з 32 символів, інакше ці зашифровані рядки
    | не буде безпечно. Будь ласка, зробіть це перед розгортанням програми!
    |
    */

    'key' => env('APP_KEY'),

    'cipher' => 'AES-256-CBC',

    /*
    |--------------------------------------------------------------------------
    | Драйвер режиму обслуговування
    |------------------------------------------------ ------------------------
    |
    | Ці параметри конфігурації визначають драйвер, який використовується для визначення та
    | керувати статусом «режим обслуговування» Laravel. Драйвер «кешу» буде
    | дозволяє контролювати режим обслуговування на кількох машинах.
    |
    | Підтримувані драйвери: "файл", "кеш"
    |
    */

    'maintenance' => [
        'driver' => 'file',
        // 'store'  => 'redis',
    ],

    /*
    |--------------------------------------------------------------------------
    | Автоматично завантажені постачальники послуг
    |------------------------------------------------ ------------------------
    |
    | Перелічені тут постачальники послуг будуть автоматично завантажені на
    | запит до вашої заявки. Не соромтеся додавати власні послуги
    | цей масив, щоб надати розширену функціональність вашим програмам.
    |
    */

    'providers' => ServiceProvider::defaultProviders()->merge([
        /*
         * Package Service Providers...
         */

        /*
         * Application Service Providers...
         */
        App\Providers\AppServiceProvider::class,
        App\Providers\AuthServiceProvider::class,
        // App\Providers\BroadcastServiceProvider::class,
        App\Providers\EventServiceProvider::class,
        App\Providers\RouteServiceProvider::class,
    ])->toArray(),

    /*
    |--------------------------------------------------------------------------
    | Псевдоніми класів
    |------------------------------------------------ ------------------------
    |
    | Цей масив псевдонімів класів буде зареєстровано, коли ця програма
    | розпочато. Однак не соромтеся реєструвати скільки завгодно
    | псевдоніми завантажуються "ліниво", тому вони не перешкоджають продуктивності.
    |
    */

    'aliases' => Facade::defaultAliases()->merge([
        // 'Example' => App\Facades\Example::class,
    ])->toArray(),

];
