<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Автентифікація за замовчуванням
    |------------------------------------------------ ------------------------
    |
    | Ця опція керує параметрами автентифікації за замовчуванням і паролем
    | скинути параметри для вашої програми. Ви можете змінити ці параметри за замовчуванням
    | за потреби, але вони є ідеальним початком для більшості програм.
    |
    */

    'defaults' => [
        'guard' => 'web',
        'passwords' => 'users',
    ],

    /*
    |--------------------------------------------------------------------------
    | Охоронці автентифікації
    |------------------------------------------------ ------------------------
    |
    | Далі ви можете визначити кожен захист автентифікації для вашої програми.
    | Звичайно, для вас визначено чудову конфігурацію за замовчуванням
    | тут, який використовує сховище сеансу та постачальника користувача Eloquent.
    |
    | Усі драйвери автентифікації мають постачальника користувача. Це визначає, як
    | користувачів фактично вилучаються з вашої бази даних чи іншого сховища
    | механізми, які використовує ця програма для збереження даних вашого користувача.
    |
    | Підтримується: "сесія"
    |
    */

    'guards' => [
        'web' => [
            'driver' => 'session',
            'provider' => 'users',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Постачальники користувачів
    |------------------------------------------------ ------------------------
    |
    | Усі драйвери автентифікації мають постачальника користувача. Це визначає, як
    | користувачів фактично вилучаються з вашої бази даних чи іншого сховища
    | механізми, які використовує ця програма для збереження даних вашого користувача.
    |
    | Якщо у вас є кілька таблиць або моделей користувачів, ви можете налаштувати кілька
    | джерела, які представляють кожну модель / таблицю. Ці джерела можуть потім
    | буде призначено будь-яким додатковим охоронцям автентифікації, які ви визначили.
    |
    | Підтримується: "база даних", "красномовний"
    |
    */

    'providers' => [
        'users' => [
            'driver' => 'eloquent',
            'model' => App\Models\User::class,
        ],

        // 'users' => [
        //     'driver' => 'database',
        //     'table' => 'users',
        // ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Скидання паролів
    |------------------------------------------------ ------------------------
    |
    | Ви можете вказати кілька конфігурацій скидання пароля, якщо у вас є більше
    | ніж одну таблицю або модель користувача в програмі, яку ви хочете мати
    | окремі налаштування скидання пароля на основі конкретних типів користувачів.
    |
    | Термін дії – це кількість хвилин для кожного маркера скидання
    | вважається дійсним. Ця функція безпеки зберігає токени недовго
    | у них менше часу, щоб вгадати. Ви можете змінити це за потреби.
    |
    | Налаштування дросельної заслінки – це кількість секунд, яку користувач повинен зачекати, перш ніж
    | створення додаткових токенів для скидання пароля. Це запобігає користувачеві
    | швидко генерує дуже велику кількість токенів для скидання пароля.
    |
    */

    'passwords' => [
        'users' => [
            'provider' => 'users',
            'table' => 'password_reset_tokens',
            'expire' => 60,
            'throttle' => 60,
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Час очікування підтвердження пароля
    |------------------------------------------------ ------------------------
    |
    | Тут ви можете визначити кількість секунд до підтвердження пароля
    | час очікування, і користувачеві пропонується повторно ввести свій пароль за допомогою
    | екран підтвердження. За замовчуванням тайм-аут триває три години.
    |
    */

    'password_timeout' => 10800,

];
