<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Конфігурація спільного використання ресурсів між джерелами (CORS).
    |------------------------------------------------ ------------------------
    |
    | Тут ви можете налаштувати параметри спільного використання ресурсів із різних джерел
    | або "CORS". Це визначає, які операції між джерелами можуть виконуватися
    | у веб-браузерах. Ви можете налаштувати ці параметри за потреби.
    |
    | To learn more: https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS
    |
    */

    'paths' => ['api/*', 'sanctum/csrf-cookie'],

    'allowed_methods' => ['*'],

    'allowed_origins' => ['*'],

    'allowed_origins_patterns' => [],

    'allowed_headers' => ['*'],

    'exposed_headers' => [],

    'max_age' => 0,

    'supports_credentials' => false,

];
