<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Диск файлової системи за замовчуванням
    |------------------------------------------------ ------------------------
    |
    | Тут ви можете вказати типовий диск файлової системи, який слід використовувати
    | за каркасом. «Локальний» диск, а також різноманітні хмарні
    | для вашої програми доступні диски на основі. Просто зберігайте!
    |
    */

    'default' => env('FILESYSTEM_DISK', 'local'),

    /*
    |--------------------------------------------------------------------------
    | Диски файлової системи
    |------------------------------------------------ ------------------------
    |
    | Тут ви можете налаштувати скільки завгодно "дисків" файлової системи, і ви
    | може навіть налаштувати кілька дисків одного драйвера. За замовчуванням є
    | було встановлено для кожного драйвера як приклад необхідних значень.
    |
    | Supported Drivers: "local", "ftp", "sftp", "s3"
    |
    */

    'disks' => [

        'local' => [
            'driver' => 'local',
            'root' => storage_path('app'),
            'throw' => false,
        ],

        'public' => [
            'driver' => 'local',
            'root' => storage_path('app/public'),
            'url' => env('APP_URL').'/storage',
            'visibility' => 'public',
            'throw' => false,
        ],

        's3' => [
            'driver' => 's3',
            'key' => env('AWS_ACCESS_KEY_ID'),
            'secret' => env('AWS_SECRET_ACCESS_KEY'),
            'region' => env('AWS_DEFAULT_REGION'),
            'bucket' => env('AWS_BUCKET'),
            'url' => env('AWS_URL'),
            'endpoint' => env('AWS_ENDPOINT'),
            'use_path_style_endpoint' => env('AWS_USE_PATH_STYLE_ENDPOINT', false),
            'throw' => false,
        ],

    ],

    /*
    |--------------------------------------------------------------------------
    | Символічні посилання
    |------------------------------------------------ ------------------------
    |
    | Тут ви можете налаштувати символічні посилання, які будуть створені, коли
    | Команда `storage:link` Artisan виконується. Ключі масиву повинні бути
    | місця розташування посилань і значення мають бути їхніми цілями.
    |
    */

    'links' => [
        public_path('storage') => storage_path('app/public'),
    ],

];
