<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Типовий хеш-драйвер
    |------------------------------------------------ ------------------------
    |
    | Цей параметр керує хеш-драйвером за умовчанням, який використовуватиметься для хешування
    | паролі для вашої програми. За замовчуванням використовується алгоритм bcrypt
    | використовуваний; однак ви можете змінити цей параметр, якщо бажаєте.
    |
    | Supported: "bcrypt", "argon", "argon2id"
    |
    */

    'driver' => 'bcrypt',

    /*
    |--------------------------------------------------------------------------
    | Параметри Bcrypt
    |------------------------------------------------ ------------------------
    |
    | Тут ви можете вказати параметри конфігурації, які слід використовувати, коли
    | паролі хешуються за допомогою алгоритму Bcrypt. Це дозволить вам
    | щоб контролювати час, необхідний для хешування даного пароля.
    |
    */

    'bcrypt' => [
        'rounds' => env('BCRYPT_ROUNDS', 10),
    ],

    /*
    |--------------------------------------------------------------------------
    | Варіанти аргону
    |------------------------------------------------ ------------------------
    |
    | Тут ви можете вказати параметри конфігурації, які слід використовувати, коли
    | паролі хешуються за допомогою алгоритму Argon. Це дозволить вам
    | щоб контролювати час, необхідний для хешування даного пароля.
    |
    */

    'argon' => [
        'memory' => 65536,
        'threads' => 1,
        'time' => 4,
    ],

];
