<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Розсилка за замовчуванням
    |------------------------------------------------ ------------------------
    |
    | Цей параметр керує поштовою програмою за замовчуванням, яка використовується для надсилання будь-якої електронної пошти
    | повідомлення, надіслані вашою програмою. Можливе налаштування альтернативних поштових програм
    | і використовується за потреби; однак цей листовник використовуватиметься за замовчуванням.
    |
    */

    'default' => env('MAIL_MAILER', 'smtp'),

    /*
    |--------------------------------------------------------------------------
    | Конфігурації поштової програми
    |------------------------------------------------ ------------------------
    |
    | Тут ви можете налаштувати всі поштові програми, які використовує ваша програма, а також
    | їхні відповідні налаштування. Було налаштовано кілька прикладів
    | Ви можете додати свій власний відповідно до вимог програми.
    |
    | Laravel підтримує різноманітні драйвери «транспортування» пошти, які можна використовувати під час
    | відправлення електронного листа. Ви вкажете, який з них ви використовуєте для свого
    | розсилки нижче. За потреби ви можете додавати додаткові розсилки.
    |
    | Supported: "smtp", "sendmail", "mailgun", "ses", "ses-v2",
    |            "postmark", "log", "array", "failover"
    |
    */

    'mailers' => [
        'smtp' => [
            'transport' => 'smtp',
            'url' => env('MAIL_URL'),
            'host' => env('MAIL_HOST', 'smtp.mailgun.org'),
            'port' => env('MAIL_PORT', 587),
            'encryption' => env('MAIL_ENCRYPTION', 'tls'),
            'username' => env('MAIL_USERNAME'),
            'password' => env('MAIL_PASSWORD'),
            'timeout' => null,
            'local_domain' => env('MAIL_EHLO_DOMAIN'),
        ],

        'ses' => [
            'transport' => 'ses',
        ],

        'mailgun' => [
            'transport' => 'mailgun',
            // 'client' => [
            //     'timeout' => 5,
            // ],
        ],

        'postmark' => [
            'transport' => 'postmark',
            // 'client' => [
            //     'timeout' => 5,
            // ],
        ],

        'sendmail' => [
            'transport' => 'sendmail',
            'path' => env('MAIL_SENDMAIL_PATH', '/usr/sbin/sendmail -bs -i'),
        ],

        'log' => [
            'transport' => 'log',
            'channel' => env('MAIL_LOG_CHANNEL'),
        ],

        'array' => [
            'transport' => 'array',
        ],

        'failover' => [
            'transport' => 'failover',
            'mailers' => [
                'smtp',
                'log',
            ],
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Глобальна адреса "Від".
    |------------------------------------------------ ------------------------
    |
    | Ви можете забажати, щоб усі електронні листи, надіслані вашою програмою, надсилалися з
    | та сама адреса. Тут ви можете вказати ім’я та адресу
    | використовується глобально для всіх електронних листів, які надсилаються вашою програмою.
    |
    */

    'from' => [
        'address' => env('MAIL_FROM_ADDRESS', 'hello@example.com'),
        'name' => env('MAIL_FROM_NAME', 'Example'),
    ],

    /*
    |--------------------------------------------------------------------------
    | Налаштування пошти Markdown
    |------------------------------------------------ ------------------------
    |
    | Якщо ви використовуєте відтворення електронної пошти на основі Markdown, ви можете налаштувати свій
    | шляхи теми та компонентів тут, що дозволяє налаштувати дизайн
    | електронних листів. Або ви можете просто залишитися стандартними параметрами Laravel!
    |
    */

    'markdown' => [
        'theme' => 'default',

        'paths' => [
            resource_path('views/vendor/mail'),
        ],
    ],

];
