<?php

use Laravel\Sanctum\Sanctum;

return [

    /*
    |--------------------------------------------------------------------------
    | Домени із збереженням стану
    |------------------------------------------------ ------------------------
    |
    | Запити від наведених нижче доменів/хостів отримуватимуть API зі збереженням стану
    | аутентифікаційні файли cookie. Як правило, це має бути ваш місцевий
    | і робочі домени, які отримують доступ до вашого API через зовнішній SPA.
    |
    */

    'stateful' => explode(',', env('SANCTUM_STATEFUL_DOMAINS', sprintf(
        '%s%s',
        'localhost,localhost:3000,127.0.0.1,127.0.0.1:8000,::1',
        Sanctum::currentApplicationUrlWithPort()
    ))),

    /*
    |--------------------------------------------------------------------------
    | Охоронці святилища
    |------------------------------------------------ ------------------------
    |
    | Цей масив містить засоби захисту автентифікації, які перевірятимуться, коли
    | Sanctum намагається автентифікувати запит. Якщо ніхто з цих охоронців
    | можуть автентифікувати запит, Sanctum використовуватиме носій
    | маркер, присутній у вхідному запиті на автентифікацію.
    |
    */

    'guard' => ['web'],

    /*
    |--------------------------------------------------------------------------
    | Хвилини закінчення
    |------------------------------------------------ ------------------------
    |
    | Це значення контролює кількість хвилин, доки не буде виданий маркер
    | вважається таким, що закінчився. Якщо це значення дорівнює нулю, доступні особисті маркери доступу
    | не закінчується. Це не змінить тривалість сеансів першої сторони.
    |
    */

    'expiration' => null,

    /*
    |--------------------------------------------------------------------------
    | Проміжне програмне забезпечення Sanctum
    |------------------------------------------------ ------------------------
    |
    | Під час автентифікації вашого основного SPA за допомогою Sanctum вам може знадобитися
    | налаштувати деякі проміжні програми, які Sanctum використовує під час обробки
    | запит. За потреби ви можете змінити наведене нижче проміжне програмне забезпечення.
    |
    */

    'middleware' => [
        'verify_csrf_token' => App\Http\Middleware\VerifyCsrfToken::class,
        'encrypt_cookies' => App\Http\Middleware\EncryptCookies::class,
    ],

];
